# BASICS

In [1]:
print("Hello World")

Hello World

In [2]:
x="Hello World"
print(x)

Hello World

In [3]:
Name= "John Smith"
print(Name)

John Smith

In [4]:
x=4 
y=4
z=4
print(z)

4

In [5]:
x=4
x="Sally"
print(x)

Sally

In [6]:
x,y,z="Orange","Banana","Cherry"
print(x)
print(y)
print(z)

Orange
Banana
Cherry

In [7]:
First_Name= "Mercy"
Middle_Name="Dufie"
Last_Name="Boateng"
print(First_Name+" "+Middle_Name+" "+Last_Name)
print(First_Name+Middle_Name+Last_Name+"@gmail.com")
print(Middle_Name*3)

Mercy Dufie Boateng
MercyDufieBoateng@gmail.com
DufieDufieDufie

In [8]:
print(10*3)
print(12-5)

30
7

# INDEXING

In [9]:
name="maxwell"
print(len(name))

7

# LIST
#.append
#.insert
#.sort
#.remove

In [10]:
students=["Dzifa","Addobea","Mercy","Pearl","Annie"]
students.append("Josie")
print(students)

['Dzifa', 'Addobea', 'Mercy', 'Pearl', 'Annie', 'Josie']

In [11]:
students.insert(1,"Josie")
print(students)

['Dzifa', 'Josie', 'Addobea', 'Mercy', 'Pearl', 'Annie', 'Josie']

In [12]:
students=["Dzifa","Addobea","Mercy","Pearl","Annie"]
students.sort(reverse=True)
print(students)

['Pearl', 'Mercy', 'Dzifa', 'Annie', 'Addobea']

In [13]:
students.remove("Mercy")
print(students)

['Pearl', 'Dzifa', 'Annie', 'Addobea']

# Dictionary

In [14]:
Profile= {'Name':'Kofi', 'food':'Tea', 'Country':'China', 'Gender':'Male'}
print(Profile)

{'Name': 'Kofi', 'food': 'Tea', 'Country': 'China', 'Gender': 'Male'}

#Slicers

In [15]:
print(Profile['Country'])

China

In [16]:
#Making Changes

In [17]:
Profile['Food']='Fried Rice'
print(Profile)

{'Name': 'Kofi', 'food': 'Tea', 'Country': 'China', 'Gender': 'Male', 'Food': 'Fried Rice'}

In [18]:
#Addition

In [19]:
Profile['Department']='Engineering'
print(Profile)

{'Name': 'Kofi', 'food': 'Tea', 'Country': 'China', 'Gender': 'Male', 'Food': 'Fried Rice', 'Department': 'Engineering'}

In [20]:
#Remove

In [21]:
del Profile['Department']
print(Profile)

{'Name': 'Kofi', 'food': 'Tea', 'Country': 'China', 'Gender': 'Male', 'Food': 'Fried Rice'}

# Conditional Statements & Loops

In [22]:
boy='Kofi'
if boy=='Handsome':
     print('I like you')
elif boy=='rich and hardworking':
   print('I still like you')
else:
     print('go away')

go away

# File Handling

In [23]:
import pandas as pd

In [27]:
data=pd.read_excel(r'/Users/kwakua/Documents/Excel Lessons/Raw Data.xlsx')

In [28]:
print(data)

          FULL NAME  GENDER DEPARTMENT  YEARS OF EXPERIENCE  JOB RATINGS
0      Regina Gomez  Female     Sales                     5            5
1         Jolie Kov  Female         IT                   10            4
2     Andre Wheeler    Male   Facility                   12            5
3      Megan Butler  Female     Sales                    15            2
4      Ria Fletcher  Female   Facility                    9            3
5     Michael Korby    Male         IT                   20            1
6         Eric Pena    Male     Sales                    14            2
7   Raphael Andrews    Male         IT                   17            3
8     Daine Mattews  Female   Facility                    6            4
9      Jeffery West    Male         IT                    7            5
10    Josie Wheeler  Female         IT                   18            5
11     Genny Talyor  Female     Sales                    20            5
12  Lilian Coleslow  Female   Facility                   15            3
13      DanieL Koch    Male   Facility                   15            3
14   Sheela Gaines   Female     Sales                    19            5
15   Robert Camillo    Male         IT                   16            4
16        Roy Pratt    Male     Sales                    13            2
17  Gilbert Shannon    Male   Facility                   11            1
18  Joseph Schwatrz    Male     Sales                     8            2
19     Ethel Jumper  Female   Facility                   10            3

In [29]:
print(data.head(5))

       FULL NAME  GENDER DEPARTMENT  YEARS OF EXPERIENCE  JOB RATINGS
0   Regina Gomez  Female     Sales                     5            5
1      Jolie Kov  Female         IT                   10            4
2  Andre Wheeler    Male   Facility                   12            5
3   Megan Butler  Female     Sales                    15            2
4   Ria Fletcher  Female   Facility                    9            3

In [30]:
print(data.tail(5))

          FULL NAME  GENDER DEPARTMENT  YEARS OF EXPERIENCE  JOB RATINGS
15   Robert Camillo    Male         IT                   16            4
16        Roy Pratt    Male     Sales                    13            2
17  Gilbert Shannon    Male   Facility                   11            1
18  Joseph Schwatrz    Male     Sales                     8            2
19     Ethel Jumper  Female   Facility                   10            3

In [31]:
pd.DataFrame(data)

          FULL NAME  GENDER DEPARTMENT  YEARS OF EXPERIENCE  JOB RATINGS
0      Regina Gomez  Female     Sales                     5            5
1         Jolie Kov  Female         IT                   10            4
2     Andre Wheeler    Male   Facility                   12            5
3      Megan Butler  Female     Sales                    15            2
4      Ria Fletcher  Female   Facility                    9            3
5     Michael Korby    Male         IT                   20            1
6         Eric Pena    Male     Sales                    14            2
7   Raphael Andrews    Male         IT                   17            3
8     Daine Mattews  Female   Facility                    6            4
9      Jeffery West    Male         IT                    7            5
10    Josie Wheeler  Female         IT                   18            5
11     Genny Talyor  Female     Sales                    20            5
12  Lilian Coleslow  Female   Facility                   15            3
13      DanieL Koch    Male   Facility                   15            3
14   Sheela Gaines   Female     Sales                    19            5
15   Robert Camillo    Male         IT                   16            4
16        Roy Pratt    Male     Sales                    13            2
17  Gilbert Shannon    Male   Facility                   11            1
18  Joseph Schwatrz    Male     Sales                     8            2
19     Ethel Jumper  Female   Facility                   10            3

In [32]:
print(data['FULL NAME'])

0        Regina Gomez
1           Jolie Kov
2       Andre Wheeler
3        Megan Butler
4        Ria Fletcher
5       Michael Korby
6           Eric Pena
7     Raphael Andrews
8       Daine Mattews
9        Jeffery West
10      Josie Wheeler
11       Genny Talyor
12    Lilian Coleslow
13        DanieL Koch
14     Sheela Gaines
15     Robert Camillo
16          Roy Pratt
17    Gilbert Shannon
18    Joseph Schwatrz
19       Ethel Jumper
Name: FULL NAME, dtype: object

In [45]:
data.loc[3,'FULL NAME':]

FULL NAME              Megan Butler
GENDER                       Female
DEPARTMENT                   Sales
YEARS OF EXPERIENCE              15
JOB RATINGS                       2
Name: 3, dtype: object

In [51]:
data.iloc[0,[0,4]]

FULL NAME      Regina Gomez
JOB RATINGS               5
Name: 0, dtype: object

In [59]:
data.loc[data.GENDER=='Male']

          FULL NAME GENDER DEPARTMENT  YEARS OF EXPERIENCE  JOB RATINGS
2     Andre Wheeler   Male   Facility                   12            5
5     Michael Korby   Male         IT                   20            1
6         Eric Pena   Male     Sales                    14            2
7   Raphael Andrews   Male         IT                   17            3
9      Jeffery West   Male         IT                    7            5
13      DanieL Koch   Male   Facility                   15            3
15   Robert Camillo   Male         IT                   16            4
16        Roy Pratt   Male     Sales                    13            2
17  Gilbert Shannon   Male   Facility                   11            1
18  Joseph Schwatrz   Male     Sales                     8            2

In [61]:
data.loc[data.GENDER=='Female']

          FULL NAME  GENDER DEPARTMENT  YEARS OF EXPERIENCE  JOB RATINGS
0      Regina Gomez  Female     Sales                     5            5
1         Jolie Kov  Female         IT                   10            4
3      Megan Butler  Female     Sales                    15            2
4      Ria Fletcher  Female   Facility                    9            3
8     Daine Mattews  Female   Facility                    6            4
10    Josie Wheeler  Female         IT                   18            5
11     Genny Talyor  Female     Sales                    20            5
12  Lilian Coleslow  Female   Facility                   15            3
14   Sheela Gaines   Female     Sales                    19            5
19     Ethel Jumper  Female   Facility                   10            3

In [68]:
data.iloc[3,[0,3]]

FULL NAME              Megan Butler
YEARS OF EXPERIENCE              15
Name: 3, dtype: object

# Visualization in python

# Plotting with Matplotlib

In [ ]:
import matplotlib.pyplot as pH